AllExamsContentHierarchy/ChannelLevelsTopicsSkills/FoundationCoreChannel/LevelsTopicsAndSkills/Biology_DO_NOT_USE.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:rfl="http://www.rulefree.com/RfLoadDataSchema">
   <soapenv:Header />
   <soapenv:Body>
      <LoadLevelsOnlyRequest xmlns="http://www.rulefree.com/RfLoadDataSchema" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.rulefree.com/RfLoadDataSchema RfLoadDataSchema.xsd" validateOnly="false" reload="true">
         <id_system>104</id_system>
         <id_provider>0</id_provider>
         <levelOnlyArray>
            <levelOnly>
               <id_level>570</id_level>
               <subject>Biology</subject>
               <subject_header>Foundation Biology</subject_header>
               <name>Biology Foundation - Grade 8</name>
               <display_name>Biology Foundation - Grade 8</display_name>
               <description>Biology Foundation - Grade 8</description>
               <published>true</published>
               <derived>false</derived>
               <topicOnlyArray>
                  <topicOnly>
                     <id_topic>1</id_topic>
                     <subject>Biology</subject>
                     <name>Practice Tests</name>
                     <published>true</published>
                     <derived>false</derived>
                     <skillOnlyArray>
                        <skillOnly>
                           <id_skill>1</id_skill>
                           <name>Combined Practice Tests - Biology Foundation - Grade 8</name>
                           <description>Combined Practice Tests - Biology Foundation - Grade 8</description>
                        </skillOnly>
                     </skillOnlyArray>
                  </topicOnly>
                  <topicOnly>
                     <id_topic>2</id_topic>
                     <subject>Biology</subject>
                     <name>Food Production and Management</name>
                     <published>true</published>
                     <derived>false</derived>
                     <skillOnlyArray>
                        <skillOnly>
                           <id_skill>1</id_skill>
                           <name>Topic Tests - Food Production and Management</name>
                           <description>Topic Tests - Food Production and Management</description>
                        </skillOnly>
                     </skillOnlyArray>
                  </topicOnly>
                  <topicOnly>
                     <id_topic>3</id_topic>
                     <subject>Biology</subject>
                     <name>Cell - Level 1</name>
                     <published>true</published>
                     <derived>false</derived>
                     <skillOnlyArray>
                        <skillOnly>
                           <id_skill>1</id_skill>
                           <name>Topic Tests - Cell - Level 1</name>
                           <description>Topic Tests - Cell - Level 1</description>
                        </skillOnly>
                     </skillOnlyArray>
                  </topicOnly>
                  <topicOnly>
                     <id_topic>4</id_topic>
                     <subject>Biology</subject>
                     <name>Microorganisms</name>
                     <published>true</published>
                     <derived>false</derived>
                     <skillOnlyArray>
                        <skillOnly>
                           <id_skill>1</id_skill>
                           <name>Topic Tests - Microorganisms</name>
                           <description>Topic Tests - Microorganisms</description>
                        </skillOnly>
                     </skillOnlyArray>
                  </topicOnly>
                  <topicOnly>
                     <id_topic>5</id_topic>
                     <subject>Biology</subject>
                     <name>Conservation of plants and Animals</name>
                     <published>true</published>
                     <derived>false</derived>
                     <skillOnlyArray>
                        <skillOnly>
                           <id_skill>1</id_skill>
                           <name>Topic Tests - Conservation of plants and Animals</name>
                           <description>Topic Tests - Conservation of plants and Animals</description>
                        </skillOnly>
                     </skillOnlyArray>
                  </topicOnly>
                  <topicOnly>
                     <id_topic>6</id_topic>
                     <subject>Biology</subject>
                     <name>Reproduction in Animals</name>
                     <published>true</published>
                     <derived>false</derived>
                     <skillOnlyArray>
                        <skillOnly>
                           <id_skill>1</id_skill>
                           <name>Topic Tests - Reproduction in Animals</name>
                           <description>Topic Tests - Reproduction in Animals</description>
                        </skillOnly>
                     </skillOnlyArray>
                  </topicOnly>
                  <topicOnly>
                     <id_topic>7</id_topic>
                     <subject>Biology</subject>
                     <name>Reaching the Age of Adolescence</name>
                     <published>true</published>
                     <derived>false</derived>
                     <skillOnlyArray>
                        <skillOnly>
                           <id_skill>1</id_skill>
                           <name>Topic Tests - Reaching the Age of Adolescence</name>
                           <description>Topic Tests - Reaching the Age of Adolescence</description>
                        </skillOnly>
                     </skillOnlyArray>
                  </topicOnly>
               </topicOnlyArray>
            </levelOnly>
            <levelOnly>
               <id_level>580</id_level>
               <subject>Biology</subject>
               <subject_header>Foundation Biology</subject_header>
               <name>Biology Foundation - Grade 9</name>
               <display_name>Biology Foundation - Grade 9</display_name>
               <description>Biology Foundation - Grade 9</description>
               <published>true</published>
               <derived>false</derived>
               <topicOnlyArray>
                  <topicOnly>
                     <id_topic>1</id_topic>
                     <subject>Biology</subject>
                     <name>Practice Tests</name>
                     <published>true</published>
                     <derived>false</derived>
                     <skillOnlyArray>
                        <skillOnly>
                           <id_skill>1</id_skill>
                           <name>Combined Practice Tests - Biology Foundation - Grade 9</name>
                           <description>Combined Practice Tests - Biology Foundation - Grade 9</description>
                        </skillOnly>
                     </skillOnlyArray>
                  </topicOnly>
                  <topicOnly>
                     <id_topic>2</id_topic>
                     <subject>Biology</subject>
                     <name>Cell - Level 2</name>
                     <published>true</published>
                     <derived>false</derived>
                     <skillOnlyArray>
                        <skillOnly>
                           <id_skill>1</id_skill>
                           <name>Topic Tests - Cell - Level 2</name>
                           <description>Topic Tests - Cell - Level 2</description>
                        </skillOnly>
                     </skillOnlyArray>
                  </topicOnly>
                  <topicOnly>
                     <id_topic>3</id_topic>
                     <subject>Biology</subject>
                     <name>Tissues</name>
                     <published>true</published>
                     <derived>false</derived>
                     <skillOnlyArray>
                        <skillOnly>
                           <id_skill>1</id_skill>
                           <name>Topic Tests - Tissues</name>
                           <description>Topic Tests - Tissues</description>
                        </skillOnly>
                     </skillOnlyArray>
                  </topicOnly>
                  <topicOnly>
                     <id_topic>4</id_topic>
                     <subject>Biology</subject>
                     <name>Diversity in Living Organisms</name>
                     <published>true</published>
                     <derived>false</derived>
                     <skillOnlyArray>
                        <skillOnly>
                           <id_skill>1</id_skill>
                           <name>Topic Tests - Diversity in Living Organisms</name>
                           <description>Topic Tests - Diversity in Living Organisms</description>
                        </skillOnly>
                     </skillOnlyArray>
                  </topicOnly>
                  <topicOnly>
                     <id_topic>5</id_topic>
                     <subject>Biology</subject>
                     <name>Health and Diseases</name>
                     <published>true</published>
                     <derived>false</derived>
                     <skillOnlyArray>
                        <skillOnly>
                           <id_skill>1</id_skill>
                           <name>Topic Tests - Health and Diseases</name>
                           <description>Topic Tests - Health and Diseases</description>
                        </skillOnly>
                     </skillOnlyArray>
                  </topicOnly>
                  <topicOnly>
                     <id_topic>6</id_topic>
                     <subject>Biology</subject>
                     <name>Improvement in Food resources</name>
                     <published>true</published>
                     <derived>false</derived>
                     <skillOnlyArray>
                        <skillOnly>
                           <id_skill>1</id_skill>
                           <name>Topic Tests - Improvement in Food resources</name>
                           <description>Topic Tests - Improvement in Food resources</description>
                        </skillOnly>
                     </skillOnlyArray>
                  </topicOnly>
                  <topicOnly>
                     <id_topic>7</id_topic>
                     <subject>Biology</subject>
                     <name>Natural Resources</name>
                     <published>true</published>
                     <derived>false</derived>
                     <skillOnlyArray>
                        <skillOnly>
                           <id_skill>1</id_skill>
                           <name>Topic Tests - Natural Resources</name>
                           <description>Topic Tests - Natural Resources</description>
                        </skillOnly>
                     </skillOnlyArray>
                  </topicOnly>
               </topicOnlyArray>
            </levelOnly>
            <levelOnly>
               <id_level>590</id_level>
               <subject>Biology</subject>
               <subject_header>Foundation Biology</subject_header>
               <name>Biology Foundation - Grade 10</name>
               <display_name>Biology Foundation - Grade 10</display_name>
               <description>Biology Foundation - Grade 10</description>
               <published>true</published>
               <derived>false</derived>
               <topicOnlyArray>
                  <topicOnly>
                     <id_topic>1</id_topic>
                     <subject>Biology</subject>
                     <name>Practice Tests</name>
                     <published>true</published>
                     <derived>false</derived>
                     <skillOnlyArray>
                        <skillOnly>
                           <id_skill>1</id_skill>
                           <name>Combined Practice Tests - Biology Foundation - Grade 10</name>
                           <description>Combined Practice Tests - Biology Foundation - Grade 10</description>
                        </skillOnly>
                     </skillOnlyArray>
                  </topicOnly>
                  <topicOnly>
                     <id_topic>2</id_topic>
                     <subject>Biology</subject>
                     <name>Life Process</name>
                     <published>true</published>
                     <derived>false</derived>
                     <skillOnlyArray>
                        <skillOnly>
                           <id_skill>1</id_skill>
                           <name>Topic Tests - Life Process</name>
                           <description>Topic Tests - Life Process</description>
                        </skillOnly>
                     </skillOnlyArray>
                  </topicOnly>
                  <topicOnly>
                     <id_topic>3</id_topic>
                     <subject>Biology</subject>
                     <name>Control and Corordination</name>
                     <published>true</published>
                     <derived>false</derived>
                     <skillOnlyArray>
                        <skillOnly>
                           <id_skill>1</id_skill>
                           <name>Topic Tests - Control and Corordination</name>
                           <description>Topic Tests - Control and Corordination</description>
                        </skillOnly>
                     </skillOnlyArray>
                  </topicOnly>
                  <topicOnly>
                     <id_topic>4</id_topic>
                     <subject>Biology</subject>
                     <name>Reproduction in Animals</name>
                     <published>true</published>
                     <derived>false</derived>
                     <skillOnlyArray>
                        <skillOnly>
                           <id_skill>1</id_skill>
                           <name>Topic Tests - Reproduction in Animals</name>
                           <description>Topic Tests - Reproduction in Animals</description>
                        </skillOnly>
                     </skillOnlyArray>
                  </topicOnly>
                  <topicOnly>
                     <id_topic>5</id_topic>
                     <subject>Biology</subject>
                     <name>Heredity and Evolution</name>
                     <published>true</published>
                     <derived>false</derived>
                     <skillOnlyArray>
                        <skillOnly>
                           <id_skill>1</id_skill>
                           <name>Topic Tests - Heredity and Evolution</name>
                           <description>Topic Tests - Heredity and Evolution</description>
                        </skillOnly>
                     </skillOnlyArray>
                  </topicOnly>
                  <topicOnly>
                     <id_topic>6</id_topic>
                     <subject>Biology</subject>
                     <name>Our Environment</name>
                     <published>true</published>
                     <derived>false</derived>
                     <skillOnlyArray>
                        <skillOnly>
                           <id_skill>1</id_skill>
                           <name>Topic Tests - Our Environment</name>
                           <description>Topic Tests - Our Environment</description>
                        </skillOnly>
                     </skillOnlyArray>
                  </topicOnly>
                  <topicOnly>
                     <id_topic>7</id_topic>
                     <subject>Biology</subject>
                     <name>Management of Natural Resources</name>
                     <published>true</published>
                     <derived>false</derived>
                     <skillOnlyArray>
                        <skillOnly>
                           <id_skill>1</id_skill>
                           <name>Topic Tests - Management of Natural Resources</name>
                           <description>Topic Tests - Management of Natural Resources</description>
                        </skillOnly>
                     </skillOnlyArray>
                  </topicOnly>
               </topicOnlyArray>
            </levelOnly>
         </levelOnlyArray>
      </LoadLevelsOnlyRequest>
   </soapenv:Body>
</soapenv:Envelope>